public class Main {
    public static void main(String[] args) {
        Human worker = new AdapterHumanToWorker(); //создаем новый обьект типа интерфейса Human с поведением класса AdapterHumanToWorker()
        //ссылочная переменная worker

        worker.put(); //для ссылочной переменной вызываем метод с реализацией в классе-адаптере
        worker.carry(); //для ссылочной переменной вызываем метод с реализацией в классе-адаптере
        worker.liftUp(); //для ссылочной переменной вызываем метод с реализацией в классе-адаптере
        worker.twist(); //для ссылочной переменной вызываем метод с реализацией в классе-адаптере
    }
}